const questionArray = [
  {
    question: "송상록이 응원하는 야구 팀은?",
    options: [
      "LG 트윈스",
      "KIA 타이거즈",
      "한화 이글스",
      "삼성 라이온즈",
      "두산 베어스",
    ],
    answer: 0,
    explanation:
      "송상록은 서울의 자존심이자 최고의 프로야구 구단인 LG 트윈스를 응원한다.",
  },
  {
    question: "송상록의 탄생 연도는?",
    options: ["1998년", "1999년", "2000년", "2001년", "2002년"],
    answer: 2,
    explanation: "송상록의 생일은 2000년 7월 22일이다.",
  },
  {
    question: "송상록이 사용하는 휴대폰은?",
    options: [
      "아이폰 15 Pro",
      "아이폰 16",
      "샤오미 15 울트라",
      "갤럭시 Z 플립 6",
      "갤럭시 S23",
    ],
    answer: 4,
    explanation:
      "송상록은 갤럭시 S23을 2년째 사용하고 있다. 폰이 작고 가벼워서 마음에 들어한다. 원래는 S20을 사용하다가, 전동 킥보드에 치여서 폰이 망가져 강제로 바꾸게 됐다.",
  },
  {
    question: "송상록이 못 먹는 음식은?",
    options: ["순대", "토마토", "오므라이스", "탕수육", "팥빙수"],
    answer: 1,
    explanation:
      "송상록은 버거킹이나 서브웨이에서 항상 토마토를 빼 먹을 정도로 토마토를 질색한다.",
  },
  {
    question: "송상록이 갔다온 군대는?",
    options: ["육군", "해군", "공군", "해병대", "사회복무"],
    answer: 2,
    explanation:
      "송상록은 2021년 2월부터 2022년 11월까지 공군에서 전산병으로 복무했다.",
  },
  {
    question: "송상록의 탄생 지역은?",
    options: [
      "인천광역시 남동구",
      "서울특별시 관악구",
      "대전광역시 서구",
      "전북특별자치도 익산시",
      "경기도 화성시",
    ],
    answer: 3,
    explanation: "송상록은 익산시 원광대 병원에서 태어났다.",
  },
  {
    question: "송상록이 제일 좋아하는 게임은?",
    options: [
      "메타포: 리판타지오",
      "파이널 판타지 6",
      "제노블레이드 크로니클스",
      "포켓몬스터 에메랄드",
      "페르소나 4",
    ],
    answer: 4,
    explanation:
      "송상록이 제일 좋아하는 게임은 페르소나 4다. 특히 주인공, 사토나카 치에, 타츠미 칸지를 좋아한다.",
  },
  {
    question: "송상록이 제일 좋아하는 견종은?",
    options: ["골든 리트리버", "말티즈", "사모예드", "치와아", "시츄"],
    answer: 1,
    explanation:
      "송상록은 쪼그만 귀여운 말티즈를 좋아한다. 나중에 큰 집에서 살게 되면 말티즈를 분양해서 몽글이라고 이름 짓고 키우는 게 소원이다.",
  },
  {
    question: "송상록이 제일 좋아하는 과일은?",
    options: ["사과", "포도", "딸기", "체리", "키위"],
    answer: 2,
    explanation:
      "송상록은 딸기를 좋아해서 인스타 ID도 strawberry_r0k 으로 지었다.",
  },
];

module.exports = { questionArray };
